app/views/profiles/_form.html.erb

  <% if @profile.errors.count == 1 %>
  <h5><%= t("activerecord.errors.template.header.one", model: t("activerecord.models.profile")) %></h5>
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 ORDER BY "profiles"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]