app/views/profiles/index.html.erb

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 ORDER BY "profiles"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
              <tr>
                                  <th><%= t("activerecord.attributes.profile.first_name") %></th>