app/views/profiles/show.html.erb

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 ORDER BY "profiles"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
                  <td>
                    <%= t("activerecord.attributes.profile.first_name") %>: <br />