app/views/welcome/index.html.erb

SELECT  "requisitions".* FROM "requisitions" WHERE "requisitions"."profile_id" = $1 LIMIT $2  [["profile_id", 12], ["LIMIT", 1]]
SELECT "references".* FROM "references" WHERE "references"."requisition_id" = $1  [["requisition_id", 4]]
---
<% if current_profile.requisition%>
  <% if current_profile.requisition.references.length >= 3%>

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 ORDER BY "profiles"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
      <% if @profile.errors.count == 1 %>
      <h5><%= t("activerecord.errors.template.header.one", model: t("activerecord.models.profile")) %></h5>