app/views/requisitions/_form.html.erb

SELECT  "requisitions".* FROM "requisitions" WHERE "requisitions"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  <% if @requisition.errors.count == 1 %>
  <h5><%= t("activerecord.errors.template.header.one", model: t("activerecord.models.requisition")) %></h5>

SELECT "references".* FROM "references" WHERE "references"."requisition_id" = $1  [["requisition_id", 4]]
---
<script type="text/javascript">
  $(".submit-form-x").click(function(e){
    e.preventDefault();
    if( $(".references-div").length >= 3){
      $("form").submit()
    }else{
      alert("te faltan referencias")
    }
  })