app/views/references/index.html.erb

              <tr>
                                  <th><%= t("activerecord.attributes.reference.first_name") %></th>
---
SELECT "references".* FROM "references"