app/controllers/profiles_controller.rb

UPDATE "profiles" SET "first_name" = $1, "second_name" = $2, "second_last_name" = $3, "first_last_name" = $4, "curp" = $5, "rfc" = $6, "gender" = $7, "birth_state" = $8, "phone_number" = $9, "birth_date" = $10, "updated_at" = $11 WHERE "profiles"."id" = $12
SELECT  "requisitions".* FROM "requisitions" WHERE "requisitions"."profile_id" = $1 LIMIT $2  [["profile_id", 12], ["LIMIT", 1]]
SELECT COUNT(*) FROM "requisitions" WHERE (profile_id =12)
---
  def update
    @requisition = Requisition.new
    respond_to do |format|
      if @profile.update(profile_params)
        if current_profile.requisition_pend.count > 0

DELETE FROM "profiles" WHERE "profiles"."id" = $1  [["id", 2]]
---
  def destroy
    @profile.destroy

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 ORDER BY "profiles"."id" ASC LIMIT $2  [["id", 12], ["LIMIT", 1]]
---
    def set_profile
      @profile = Profile.find(params[:id])