app/controllers/references_controller.rb

  def index
    @references = Reference.all
---
SELECT "references".* FROM "references"

  def destroy
    @reference.destroy
---
DELETE FROM "references" WHERE "references"."id" = $1  [["id", 1]]

    def set_reference
      @reference = Reference.find(params[:id])
---
SELECT  "references".* FROM "references" WHERE "references"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]