app/controllers/requisitions_controller.rb

SELECT "requisitions".* FROM "requisitions"
---
  def index
    @requisitions = Requisition.all

INSERT INTO "requisitions" ("income", "address_years", "company_years", "marital_status", "requested_amount", "payment_terms", "bank", "comment", "company_name", "company_phone_number", "dependents_number", "company_position", "has_sgmm", "has_imss", "has_car", "created_at", "updated_at", "profile_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18) RETURNING "id"
---
  def create
    @requisition = Requisition.new(requisition_params)

    respond_to do |format|
      if @requisition.save

UPDATE "requisitions" SET "address_years" = $1, "company_years" = $2, "company_position" = $3, "updated_at" = $4 WHERE "requisitions"."id" = $5  [["address_years", 0], ["company_years", 0], ["company_position", "Empleado"], ["updated_at", "2017-08-20 01:30:59.768101"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @requisition.update(requisition_params)

DELETE FROM "requisitions" WHERE "requisitions"."id" = $1  [["id", 1]]
---
  def destroy
    @requisition.destroy

SELECT  "requisitions".* FROM "requisitions" WHERE "requisitions"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def set_requisition
      @requisition = Requisition.find(params[:id])